#+title: Programmatically Interacting with LLMS
#+subtitle: different techniques for local, remote, rag and function calling
#+tags[]: ollama, langchain, openai, chat, rag, tools, ai, llms
#+date: 2024-04-16T18:44:19
#+draft: true

I decided to sit down over a few days (I'm at a trampoline park right
now, being a money dispensor for the kids to buy slurpees while they
tire themselves out) and figure out how to code with LLMs.  We're
going to look at how to do a single show prompt, multi message chat,
RAG /Retrieval-Augmented Generation/, and tool usage, each with the
ollama-js, openai-js, and then langchain with both ollana and openai.

I didn't quite implement every combination, but you get the idea.

#+ATTR_HTML: :class table
|           | Ollama JS | OpenAI JS | LangChain - Ollama | LangChain - OpenAI |
| Prompting | Yes       | Yes       | Yes                | Yes                |
| Chat      | Yes       |           | Yes                | Yes                |
| RAG       | Yes       | Yes       | Yes                |                    |
| Tools     | Yes       | Yes       | Yes                | Yes                |

The straightforward code of using the interfaces is shorter, but not
necessarily clearer especially with tool calling.  It is super cool to
be able to retarget the LangChain code onto a different provider and
it smooths over the differences of implementations.  I learned a lot
about what you could do by looking through it's documentation.  But in
practice, there's a lot of overhead and classes and things you need to
learn which aren't clearly necessary.  Seems like a slightly too
premature abstraction, but it is overall nice.  Worth learning even if
you don't end up using.

LangChain is a library that lets you build things on top of LLMs,
where it's relatively easy to paper over the difference between each
of the implementations and APIs.  It also has a bunch of high level
** =ollama-js=

#+begin_src bash
  npm install ollama
#+end_src

=ollama-prompt.js=:
#+begin_src javascript :tangle ollama-prompt.js
  import ollama from 'ollama';

  const msgs = [
      {
          "role": "system",
          "content": `You are a creative director at a
    marketing agency helping clients brain storm interesting ideas.`
      },
      {
          "role": "user",
          content: "Five cute names for a pet penguin"
      }
  ]

  const output = await ollama.chat({ model: "mistral", messages: msgs })

  console.log(output.message.content)
#+end_src

#+begin_src bash :results raw
  node ollama-prompt.js
#+end_src

#+RESULTS:
1. Waddles the Wonder: This name suggests that your pet penguin is a
   unique and special creature, adding an element of wonder and
   delight to its personality.
2. Peppy the Penguin: Peppy conveys energy, cheerfulness, and
   friendliness, making it a great name for a playful and charming pet
   penguin.
3. Snowball the Adventurer: This name adds a sense of adventure and
   excitement to your pet penguin's identity, implying that it's
   always up for new experiences and adventures.
4. Tuxedo Teddy: Naming your pet penguin after its distinctive
   black-and-white appearance adds a cute and endearing touch, making
   it feel like a beloved teddy bear.
5. Iggy the Ice Explorer: This name suggests that your pet penguin is
   an intrepid explorer of icy landscapes, adding a sense of adventure
   and bravery to its personality. It's also a fun play on words, as
   "iggy" could refer to both "igloo," which penguins live in, and the
   common name for penguins, which begins with the letter I.

** =open-ai=

We'll need to get an =OPENAI_API_KEY= to use this, and I'm going to
stick it in an =.env= file so here we go.

#+begin_src bash
  npm install openai dotenv
#+end_src

=open-ai-prompt.js=
#+begin_src javascript :tangle open-ai-prompt.js
  import 'dotenv/config'
  import process from 'node:process'
  import OpenAI from "openai";

  const openai = new OpenAI()

  async function main() {
    const completion = await openai.chat.completions.create({
      messages: [
          {
              role: "system",
              content:
              `You are a creative director at a marketing agency
  helping clients brain storm interesting ideas.`
          },
          {
              role: "user",
              content: "Five cute names for a pet penguin"
          }],
        model: "gpt-3.5-turbo",
    });

    console.log(completion.choices[0].message.content);
  }

  main();
#+end_src

#+begin_src bash :results raw
  node open-ai-prompt.js
#+end_src

#+RESULTS:
1. Pebbles
2. Frosty
3. Waddles
4. Pippin
5. Chilly

** LangChain Ollama
#+begin_src bash
  npm install @langchain/community
#+end_src

Pass in the =ChatOllama= model configured to the =mistral= instance
available locally.  (If you don't have it, =ollama pull mistral=)

=langchain-ollama-prompt.js=:
#+begin_src javascript :tangle langchain-ollama-prompt.js
  import { ChatOllama } from "@langchain/community/chat_models/ollama";
  import runPrompt from "./langchain-prompt.js"

  const chatModel = new ChatOllama({
      baseUrl: "http://localhost:11434", // Default value
      model: "mistral",
  });

  const answer = await runPrompt( chatModel, "Five cute names for a pet penguin" );

  console.log( answer )
#+end_src

#+begin_src bash :results raw
  node langchain-ollama-prompt.js
#+end_src

#+RESULTS:
 1. Waddles the Wonder: Named after the tiny waddle steps penguins
    make, this adorable pet penguin is full of surprises and charms
    with its unique personality.

2. Tuxedo Tot: A playful name for your pet penguin that highlights its
   distinctive black and white tuxedo-like appearance.

3. Iggy the Icebird: This creative moniker pays homage to penguins'
   avian roots as they are often referred to as "icebirds." It adds an
   element of intrigue, making your pet penguin even more captivating!

4. Pippin the Polly: A cute and catchy name for your pet penguin that
   combines playful alliteration with a nod to their polar habitat.

5. Bingo the Brave: This name conveys strength, courage, and
   adventure - perfect for a curious and adventurous pet penguin!
 
** LangChain open-ai

#+begin_src bash
  npm install @langchain/openai
#+end_src

Just use the default =ChatOpenAI= model, we could choose /anything/ but we
chose /nothing/!

=langchain-open-ai-prompt.js=:
#+begin_src javascript :tangle langchain-open-ai-prompt.js
  import 'dotenv/config'
  import { ChatOpenAI } from "@langchain/openai";
  import runPrompt from "./langchain-prompt.js"

  const chatModel = new ChatOpenAI();
  const answer = await runPrompt( chatModel, "Five cute names for a pet penguin" );

  console.log( answer )
#+end_src

#+begin_src bash :results raw
  node langchain-open-ai-prompt.js
#+end_src

#+RESULTS:
1. Fluffy
2. Snowball
3. Waddles
4. Pebbles
5. Chilly

